[[{"url":"https://www.9news.com.au/national/elderly-woman-found-dead-in-cairns-home/db0b1f7f-af0a-49b8-be84-b93cf5f65112","body":{"author":"By AAP","content":" Tweet\n Facebook\n Mail\nPolice are calling for public help in investigating the suspected murder of an elderly Cairns woman, who was found dead in her home with horrific head injuries.\nA crime scene was declared on Tuesday morning after police attended the home for an unrelated matter and unexpectedly found the distressing scene.\nAfter restraining a man at the house, officers then found the 76-year-old's body.\nDetective Inspector Jason Smith said the woman appeared to have died as a result of head injuries caused by blunt force trauma.\nAn item that may have been used to inflict the injuries was taken from the scene.\nNeighbours have told police about \"certain behaviours at the property\", and detectives are following up reports of an argument in the hours before the woman's death.\nA 43-year-old Woree man, who is known to the woman and visited the Windarra Street home regularly, is being interviewed by police.\nRELATED\n\nMan hospitalised after being shocked by overhead train wires in 'bid to rescue cat'\n'You're safe, you'll be fine': Queensland mum fears unborn baby has been left disabled by hospital drug\nTwo carpet pythons retrieved from two separate car bonnets in south-east Queensland\nPolice would like to speak with anyone who visited the home in the past week.\n1800 RESPECT (1800 737 732)\nLifeline 13 11 14\n© AAP 2020\n","date":"4:30pm Jun 9, 2020","header":"Elderly woman found dead in Cairns home"}},{"url":"https://www.9news.com.au/national/accused-qld-baby-killer-applies-for-bail/8c9efad5-d267-42e6-aa3d-ce1076ef1caa","body":{"author":"By AAP","content":" Tweet\n Facebook\n Mail\nA father who likely killed his five-month-old baby with a blow to the head should not be released from jail, Queensland prosecutors say.\nKozan Samuel Thomas Ware, 34, was charged with murder after his son, Adrian Joshua Wommie Ware, was found unresponsive in a Brisbane home in March 2017.\nWare's lawyer, Deborah Holliday, told a bail hearing on Tuesday in the Brisbane Supreme Court that the Crown's case was weak because there were alternative explanations for what caused the child's injuries.\nShe also said the intracranial bleeding found during an autopsy may not be the cause of baby Adrian's death.\n\"There was nothing in the post-mortem that determined why the child stopped breathing,\" Ms Holliday said, reading from a doctor's affidavit handed to the court.\nMs Holliday presented evidence from another doctor who said sudden infant death syndrome could not be ruled out as the cause of death.\nShe said it was also possible Adrian's injury may have been the result of a fall, and an abrasion was found on his scalp near to where the internal haemorrhage occurred.\nRELATED\n\nMan hospitalised after being shocked by overhead train wires in 'bid to rescue cat'\n'You're safe, you'll be fine': Queensland mum fears unborn baby has been left disabled by hospital drug\nTwo carpet pythons retrieved from two separate car bonnets in south-east Queensland\nProsecutor Caroline Marco said she accepted doctors had found it was possible Adrian's injury may have been caused by a fall.\nHowever, she argued there was a lack of evidence to support this.\nShe said Ware did not mention that Adrian had fallen during his first interview with police.\nHe brought it up later in the investigation.\nMs Marco said doctors also concluded that Adrian's fall was not likely to have caused his death because it allegedly happened days before he died.\nShe said the Crown's expert doctors also found the abrasion on his head could have been caused by deliberate blunt force trauma and this may have led to Adrian's death.\n\"The only explanation for that head injury is other than by a fall, which is blunt force trauma and or shaking,\" she said.\nA court has previously heard Adrian had a runny nose, a rash on his neck and scalp, abrasions on his head and face, and had vomited the day before he died.\nHe was also sleeping on mattresses without bedsheets and there was clutter spread throughout the home, which was described as unhygienic and unfit for children.\nThe hearing continues.\n© AAP 2020\n","date":"3:13pm Jun 9, 2020","header":"Accused Qld baby killer applies for bail"}}]]